In [1]:
import pandas as pd
import numpy as np

In [5]:
datos = {
    "Producto": ["Helado Chocolate", "Helado Vainilla", None,
                 "Helado Oreo", "Paletas", "Helado Chocolate"],
    "Precio": [180, 150, 160, None, 120, -180],
    "Ventas": [30, None, 20, 25, -5, 40]
}

df = pd.DataFrame(datos)
df

           Producto  Precio  Ventas
0  Helado Chocolate   180.0    30.0
1   Helado Vainilla   150.0     NaN
2              None   160.0    20.0
3       Helado Oreo     NaN    25.0
4           Paletas   120.0    -5.0
5  Helado Chocolate  -180.0    40.0

In [6]:
df.isnull().sum()

Producto    1
Precio      1
Ventas      1
dtype: int64

In [7]:
df["Producto"] = df["Producto"].fillna("Desconocido")
df["Precio"] = df["Precio"].fillna(df["Precio"].mean())
df["Ventas"] = df["Ventas"].fillna(0)

df

           Producto  Precio  Ventas
0  Helado Chocolate   180.0    30.0
1   Helado Vainilla   150.0     0.0
2       Desconocido   160.0    20.0
3       Helado Oreo    86.0    25.0
4           Paletas   120.0    -5.0
5  Helado Chocolate  -180.0    40.0

In [9]:
df["Precio"] = df["Precio"].abs()
df["Ventas"] = df["Ventas"].abs()

df

           Producto  Precio  Ventas
0  Helado Chocolate   180.0    30.0
1   Helado Vainilla   150.0     0.0
2       Desconocido   160.0    20.0
3       Helado Oreo    86.0    25.0
4           Paletas   120.0     5.0
5  Helado Chocolate   180.0    40.0

In [10]:
df["Ingreso"] = df["Precio"] * df["Ventas"]
df

           Producto  Precio  Ventas  Ingreso
0  Helado Chocolate   180.0    30.0   5400.0
1   Helado Vainilla   150.0     0.0      0.0
2       Desconocido   160.0    20.0   3200.0
3       Helado Oreo    86.0    25.0   2150.0
4           Paletas   120.0     5.0    600.0
5  Helado Chocolate   180.0    40.0   7200.0

In [11]:
df.describe()

           Precio     Ventas      Ingreso
count    6.000000   6.000000     6.000000
mean   146.000000  20.000000  3091.666667
std     36.878178  15.165751  2788.264096
min     86.000000   0.000000     0.000000
25%    127.500000   8.750000   987.500000
50%    155.000000  22.500000  2675.000000
75%    175.000000  28.750000  4850.000000
max    180.000000  40.000000  7200.000000

## Qué errores encontraste?
Algunos datos no se encontraban.

## Por que es importante limpiar datos?
Limpiar los datos facilita el trabajo.

## Qué pasaria si no se limpian?
Si los datos no se limpian, se dificultaría la interpretación de los datos.